MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K144W/startup/armc/startup_S32K144W.S
; ---------------------------------------------------------------------------------------
;  @file:    startup_S32K144W.s
;  @purpose: ARM Compiler Collection Startup File
;            S32K144W
;  @version: 2.0
;  @date:    2017-1-10
;  @build:   b170107
; ---------------------------------------------------------------------------------------
;
; Copyright (c) 1997 - 2016 , Freescale Semiconductor, Inc.
; Copyright 2016-2019 NXP
; All rights reserved.
;
; NXP Confidential. This software is owned or controlled by NXP and may only be
; used strictly in accordance with the applicable license terms. By expressly
; accepting such terms or by downloading, installing, activating and/or otherwise
; using the software, you are agreeing that you have read, and that you agree to
; comply with and are bound by, such license terms. If you do not agree to be
; bound by the applicable license terms, then you may not retain, install,
; activate or otherwise use the software. The production use license in
; Section 2.3 is expressly granted for this software.
;***************************************************************************
; Version: ARMC Compiler Collection
;***************************************************************************


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset

                AREA    |.text|, CODE, READONLY
                EXPORT  __VECTOR_TABLE

                EXPORT __RAM_VECTOR_TABLE_SIZE
                EXPORT __VECTOR_RAM
                EXPORT __VECTOR_ROM

                EXPORT __BSS_START
                EXPORT __BSS_END

                EXPORT __CODE_ROM
                EXPORT __CODE_END
                EXPORT __CODE_RAM

                EXPORT __DATA_ROM
                EXPORT __DATA_END
                EXPORT __DATA_RAM
                EXPORT __VECTOR_ROM_START
                EXPORT __VECTOR_ROM_END
                EXPORT __DATA_RAM_START
                EXPORT __DATA_RAM_END
                EXPORT __CUSTOM_SECTION_START
                EXPORT __CUSTOM_SECTION_END
                EXPORT __CODE_RAM_START
                EXPORT __CODE_RAM_END
                
                EXPORT __RAM_START
                EXPORT __RAM_END

                EXPORT __COPY_TABLE
                EXPORT __ZERO_TABLE

                IMPORT init_data_bss
                IMPORT  main
                IMPORT  __main
                IMPORT  |Image$$ARM_LIB_STACK$$ZI$$Limit|
                IMPORT  |Image$$RW_m_data_2$$ZI$$Base|
                IMPORT  |Image$$RW_m_data_2$$ZI$$Limit|

                IMPORT  |Image$$ER_m_text_const$$Base|
                IMPORT  |Image$$ER_m_text_const$$Limit|

                IMPORT  |Image$$RW_m_data$$Base|

                IMPORT  |Image$$ER_m_text_const$$Base|
                IMPORT  |Image$$ER_m_text_const$$Limit|

                IMPORT  |Image$$RW_m_data$$Length|
                IMPORT |Image$$RW_m_code$$Base|
                IMPORT |Image$$RW_m_code$$Length|
                IMPORT |Image$$ER_m_text$$Limit|

                IMPORT |Image$$VECTOR_RAM$$Length|
                IMPORT |Image$$VECTOR_RAM$$Base|

                IMPORT |Image$$VECTOR_ROM$$Length|
                IMPORT |Image$$VECTOR_ROM$$Base|
                IMPORT |Image$$RW_m_custom_section$$Base|
                IMPORT |Image$$RW_m_custom_section$$Limit|
                
                IMPORT |Image$$RW_m_data$$Limit|
                IMPORT |Image$$RW_m_code$$Limit|
                IMPORT |Image$$VECTOR_ROM$$Limit|
                
                IMPORT |Image$$ARM_LIB_STACK$$Limit|
__RAM_VECTOR_TABLE_SIZE DCD |Image$$VECTOR_ROM$$Length|
__VECTOR_RAM DCD |Image$$VECTOR_RAM$$Base|
__VECTOR_ROM DCD |Image$$VECTOR_ROM$$Base|
__VECTOR_ROM_START DCD |Image$$VECTOR_ROM$$Base|
__VECTOR_ROM_END DCD |Image$$VECTOR_ROM$$Limit|

__CODE_ROM DCD  |Image$$RW_m_data$$Length|+ |Image$$ER_m_text$$Limit|
__CODE_END DCD  |Image$$RW_m_data$$Length|+ |Image$$ER_m_text$$Limit| + |Image$$RW_m_code$$Length|
__CODE_RAM DCD |Image$$RW_m_code$$Base|
__CODE_RAM_START DCD |Image$$RW_m_code$$Base|
__CODE_RAM_END DCD |Image$$RW_m_code$$Limit|

__BSS_START DCD  |Image$$RW_m_data_2$$ZI$$Base|
__BSS_END DCD  |Image$$RW_m_data_2$$ZI$$Limit|

__DATA_RAM DCD  |Image$$RW_m_data$$Base|
__DATA_RAM_START DCD  |Image$$RW_m_data$$Base|
__DATA_RAM_END DCD  |Image$$RW_m_data$$Limit|
__DATA_ROM DCD  |Image$$ER_m_text$$Limit|
__DATA_END DCD  |Image$$RW_m_data$$Length|+ |Image$$ER_m_text$$Limit|
__CUSTOM_SECTION_START DCD |Image$$RW_m_custom_section$$Base|
__CUSTOM_SECTION_END DCD |Image$$RW_m_custom_section$$Limit|

__RAM_START DCD |Image$$VECTOR_RAM$$Base|
__RAM_END   DCD |Image$$ARM_LIB_STACK$$Limit|

		AREA    RESET, DATA, READONLY
__VECTOR_TABLE  DCD     |Image$$ARM_LIB_STACK$$ZI$$Limit| ; Top of Stack
                DCD     Reset_Handler  ; Reset Handler
                DCD     NMI_Handler                       ;NMI Handler
                DCD     HardFault_Handler                   ;Hard Fault Handler
                DCD     MemManage_Handler                   ;MPU Fault Handler
                DCD     BusFault_Handler                    ;Bus Fault Handler
                DCD     UsageFault_Handler                  ;Usage Fault Handler
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     SVC_Handler                         ;SVCall Handler
                DCD     DebugMon_Handler                    ;Debug Monitor Handler
                DCD     0                                   ;Reserved
                DCD     PendSV_Handler                      ;PendSV Handler
                DCD     SysTick_Handler                     ;SysTick Handler

                                                            ; External Interrupts
    DCD   DMA0_IRQHandler                                 ; DMA channel 0 transfer complete
    DCD   DMA1_IRQHandler                                 ; DMA channel 1 transfer complete
    DCD   DMA2_IRQHandler                                 ; DMA channel 2 transfer complete
    DCD   DMA3_IRQHandler                                 ; DMA channel 3 transfer complete
    DCD   DMA4_IRQHandler                                 ; DMA channel 4 transfer complete
    DCD   DMA5_IRQHandler                                 ; DMA channel 5 transfer complete
    DCD   DMA6_IRQHandler                                 ; DMA channel 6 transfer complete
    DCD   DMA7_IRQHandler                                 ; DMA channel 7 transfer complete
    DCD   DMA8_IRQHandler                                 ; DMA channel 8 transfer complete
    DCD   DMA9_IRQHandler                                 ; DMA channel 9 transfer complete
    DCD   DMA10_IRQHandler                                ; DMA channel 10 transfer complete
    DCD   DMA11_IRQHandler                                ; DMA channel 11 transfer complete
    DCD   DMA12_IRQHandler                                ; DMA channel 12 transfer complete
    DCD   DMA13_IRQHandler                                ; DMA channel 13 transfer complete
    DCD   DMA14_IRQHandler                                ; DMA channel 14 transfer complete
    DCD   DMA15_IRQHandler                                ; DMA channel 15 transfer complete
    DCD   DMA_Error_IRQHandler                            ; DMA error interrupt channels 0-15
    DCD   MCM_IRQHandler                                  ; FPU sources
    DCD   FTFC_IRQHandler                                 ; FTFC Command complete
    DCD   Read_Collision_IRQHandler                       ; FTFC Read collision
    DCD   LVD_LVW_IRQHandler                              ; PMC Low voltage detect interrupt
    DCD   FTFC_Fault_IRQHandler                           ; FTFC Double bit fault detect
    DCD   WDOG_EWM_IRQHandler                             ; Single interrupt vector for WDOG and EWM
    DCD   RCM_IRQHandler                                  ; RCM Asynchronous Interrupt
    DCD   LPI2C0_Master_IRQHandler                        ; LPI2C0 Master Interrupt
    DCD   LPI2C0_Slave_IRQHandler                         ; LPI2C0 Slave Interrupt
    DCD   LPSPI0_IRQHandler                               ; LPSPI0 Interrupt
    DCD   LPSPI1_IRQHandler                               ; LPSPI1 Interrupt
    DCD   LPSPI2_IRQHandler                               ; LPSPI2 Interrupt
    DCD   Reserved45_IRQHandler                           ; Reserved Interrupt 45
    DCD   Reserved46_IRQHandler                           ; Reserved Interrupt 46
    DCD   LPUART0_RxTx_IRQHandler                         ; LPUART0 Transmit / Receive Interrupt
    DCD   Reserved48_IRQHandler                           ; Reserved Interrupt 48
    DCD   LPUART1_RxTx_IRQHandler                         ; LPUART1 Transmit / Receive  Interrupt
    DCD   Reserved50_IRQHandler                           ; Reserved Interrupt 50
    DCD   LPUART2_RxTx_IRQHandler                         ; LPUART2 Transmit / Receive  Interrupt
    DCD   Reserved52_IRQHandler                           ; Reserved Interrupt 52
    DCD   Reserved53_IRQHandler                           ; Reserved Interrupt 53
    DCD   Reserved54_IRQHandler                           ; Reserved Interrupt 54
    DCD   ADC0_IRQHandler                                 ; ADC0 interrupt request.
    DCD   ADC1_IRQHandler                                 ; ADC1 interrupt request.
    DCD   CMP0_IRQHandler                                 ; CMP0 interrupt request
    DCD   Reserved58_IRQHandler                           ; Reserved Interrupt 58
    DCD   Reserved59_IRQHandler                           ; Reserved Interrupt 59
    DCD   ERM_single_fault_IRQHandler                     ; ERM single bit error correction
    DCD   ERM_double_fault_IRQHandler                     ; ERM double bit error non-correctable
    DCD   RTC_IRQHandler                                  ; RTC alarm interrupt
    DCD   RTC_Seconds_IRQHandler                          ; RTC seconds interrupt
    DCD   LPIT0_Ch0_IRQHandler                            ; LPIT0 channel 0 overflow interrupt
    DCD   LPIT0_Ch1_IRQHandler                            ; LPIT0 channel 1 overflow interrupt
    DCD   LPIT0_Ch2_IRQHandler                            ; LPIT0 channel 2 overflow interrupt
    DCD   LPIT0_Ch3_IRQHandler                            ; LPIT0 channel 3 overflow interrupt
    DCD   PDB0_IRQHandler                                 ; PDB0 interrupt
    DCD   Reserved69_IRQHandler                           ; Reserved Interrupt 69
    DCD   Reserved70_IRQHandler                           ; Reserved Interrupt 70
    DCD   Reserved71_IRQHandler                           ; Reserved Interrupt 71
    DCD   Reserved72_IRQHandler                           ; Reserved Interrupt 72
    DCD   SCG_IRQHandler                                  ; SCG bus interrupt request
    DCD   LPTMR0_IRQHandler                               ; LPTIMER interrupt request
    DCD   PORTA_IRQHandler                                ; Port A pin detect interrupt
    DCD   PORTB_IRQHandler                                ; Port B pin detect interrupt
    DCD   PORTC_IRQHandler                                ; Port C pin detect interrupt
    DCD   PORTD_IRQHandler                                ; Port D pin detect interrupt
    DCD   PORTE_IRQHandler                                ; Port E pin detect interrupt
    DCD   SWI_IRQHandler                                  ; Software interrupt
    DCD   Reserved81_IRQHandler                           ; Reserved Interrupt 81
    DCD   Reserved82_IRQHandler                           ; Reserved Interrupt 82
    DCD   Reserved83_IRQHandler                           ; Reserved Interrupt 83
    DCD   PDB1_IRQHandler                                 ; PDB1 interrupt
    DCD   FLEXIO_IRQHandler                               ; FlexIO Interrupt
    DCD   Reserved86_IRQHandler                           ; Reserved Interrupt 86
    DCD   Reserved87_IRQHandler                           ; Reserved Interrupt 87
    DCD   Reserved88_IRQHandler                           ; Reserved Interrupt 88
    DCD   Reserved89_IRQHandler                           ; Reserved Interrupt 89
    DCD   Reserved90_IRQHandler                           ; Reserved Interrupt 90
    DCD   Reserved91_IRQHandler                           ; Reserved Interrupt 91
    DCD   Reserved92_IRQHandler                           ; Reserved Interrupt 92
    DCD   Reserved93_IRQHandler                           ; Reserved Interrupt 93
    DCD   CAN0_ORed_IRQHandler                            ; CAN0 OR'ed [Bus Off OR Transmit Warning OR Receive Warning]
    DCD   CAN0_Error_IRQHandler                           ; CAN0 Interrupt indicating that errors were detected on the CAN bus
    DCD   CAN0_Wake_Up_IRQHandler                         ; CAN0 Interrupt asserted when Pretended Networking operation is enabled, and a valid message matches the selected filter criteria during Low Power mode
    DCD   CAN0_ORed_0_15_MB_IRQHandler                    ; CAN0 OR'ed Message buffer (0-15)
    DCD   CAN0_ORed_16_31_MB_IRQHandler                   ; CAN0 OR'ed Message buffer (16-31)
    DCD   CAN0_ORed_32_47_MB_IRQHandler                   ; CAN0 OR'ed Message buffer (32-47)
    DCD   CAN0_ORed_48_63_MB_IRQHandler                   ; CAN0 OR'ed Message buffer (48-63)
    DCD   CAN1_ORed_IRQHandler                            ; CAN1 OR'ed [Bus Off OR Transmit Warning OR Receive Warning]
    DCD   CAN1_Error_IRQHandler                           ; CAN1 Interrupt indicating that errors were detected on the CAN bus
    DCD   Reserved103_IRQHandler                          ; Reserved Interrupt 103
    DCD   CAN1_ORed_0_15_MB_IRQHandler                    ; CAN1 OR'ed Interrupt for Message buffer (0-15)
    DCD   CAN1_ORed_16_31_MB_IRQHandler                   ; CAN1 OR'ed Message buffer (16-31)
    DCD   CAN1_ORed_32_47_MB_IRQHandler                   ; CAN1 OR'ed Message buffer (32-47)
    DCD   CAN1_ORed_48_63_MB_IRQHandler                   ; CAN1 OR'ed Message buffer (48-63)
    DCD   Reserved108_IRQHandler                          ; Reserved Interrupt 108
    DCD   Reserved109_IRQHandler                          ; Reserved Interrupt 109
    DCD   Reserved110_IRQHandler                          ; Reserved Interrupt 110
    DCD   Reserved111_IRQHandler                          ; Reserved Interrupt 111
    DCD   Reserved112_IRQHandler                          ; Reserved Interrupt 112
    DCD   Reserved113_IRQHandler                          ; Reserved Interrupt 113
    DCD   Reserved114_IRQHandler                          ; Reserved Interrupt 114
    DCD   FTM0_Ch0_Ch1_IRQHandler                         ; FTM0 Channel 0 and 1 interrupt
    DCD   FTM0_Ch2_Ch3_IRQHandler                         ; FTM0 Channel 2 and 3 interrupt
    DCD   FTM0_Ch4_Ch5_IRQHandler                         ; FTM0 Channel 4 and 5 interrupt
    DCD   FTM0_Ch6_Ch7_IRQHandler                         ; FTM0 Channel 6 and 7 interrupt
    DCD   FTM0_Fault_IRQHandler                           ; FTM0 Fault interrupt
    DCD   FTM0_Ovf_Reload_IRQHandler                      ; FTM0 Counter overflow and Reload interrupt
    DCD   FTM1_Ch0_Ch1_IRQHandler                         ; FTM1 Channel 0 and 1 interrupt
    DCD   FTM1_Ch2_Ch3_IRQHandler                         ; FTM1 Channel 2 and 3 interrupt
    DCD   FTM1_Ch4_Ch5_IRQHandler                         ; FTM1 Channel 4 and 5 interrupt
    DCD   FTM1_Ch6_Ch7_IRQHandler                         ; FTM1 Channel 6 and 7 interrupt
    DCD   FTM1_Fault_IRQHandler                           ; FTM1 Fault interrupt
    DCD   FTM1_Ovf_Reload_IRQHandler                      ; FTM1 Counter overflow and Reload interrupt
    DCD   FTM2_Ch0_Ch1_IRQHandler                         ; FTM2 Channel 0 and 1 interrupt
    DCD   FTM2_Ch2_Ch3_IRQHandler                         ; FTM2 Channel 2 and 3 interrupt
    DCD   FTM2_Ch4_Ch5_IRQHandler                         ; FTM2 Channel 4 and 5 interrupt
    DCD   FTM2_Ch6_Ch7_IRQHandler                         ; FTM2 Channel 6 and 7 interrupt
    DCD   FTM2_Fault_IRQHandler                           ; FTM2 Fault interrupt
    DCD   FTM2_Ovf_Reload_IRQHandler                      ; FTM2 Counter overflow and Reload interrupt
    DCD   FTM3_Ch0_Ch1_IRQHandler                         ; FTM3 Channel 0 and 1 interrupt
    DCD   FTM3_Ch2_Ch3_IRQHandler                         ; FTM3 Channel 2 and 3 interrupt
    DCD   FTM3_Ch4_Ch5_IRQHandler                         ; FTM3 Channel 4 and 5 interrupt
    DCD   FTM3_Ch6_Ch7_IRQHandler                         ; FTM3 Channel 6 and 7 interrupt
    DCD   FTM3_Fault_IRQHandler                           ; FTM3 Fault interrupt
    DCD   FTM3_Ovf_Reload_IRQHandler                      ; FTM3 Counter overflow and Reload interrupt
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   DefaultISR                                      ; Default ISR
    DCD   FTFC_EEERAM_ECC_ERR_IRQnHandler                 ; FTC EEERAM ECC error
    DCD   FTFC_Mgate_ECC_ERR_IRQnHandler                  ; FFTC Mgate ECC error
    DCD   DefaultISR                                      ; Default ISR
__Vectors_End


__Vectors_Size  EQU     __Vectors_End - __VECTOR_TABLE

