MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K144W/startup/armc/startup_S32K144W.S
NMI_Handler\
                PROC
                EXPORT  NMI_Handler         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler         [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler         [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler         [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler         [WEAK]
                B       .
                ENDP
DefaultISR\
                PROC
                EXPORT  DefaultISR         [WEAK]
                B       .
                ENDP
Default_Handler PROC
                EXPORT  DMA0_IRQHandler                      [WEAK]
                EXPORT  DMA1_IRQHandler                      [WEAK]
                EXPORT  DMA2_IRQHandler                      [WEAK]
                EXPORT  DMA3_IRQHandler                      [WEAK]
                EXPORT  DMA4_IRQHandler                      [WEAK]
                EXPORT  DMA5_IRQHandler                      [WEAK]
                EXPORT  DMA6_IRQHandler                      [WEAK]
                EXPORT  DMA7_IRQHandler                      [WEAK]
                EXPORT  DMA8_IRQHandler                      [WEAK]
                EXPORT  DMA9_IRQHandler                      [WEAK]
                EXPORT  DMA10_IRQHandler                     [WEAK]
                EXPORT  DMA11_IRQHandler                     [WEAK]
                EXPORT  DMA12_IRQHandler                     [WEAK]
                EXPORT  DMA13_IRQHandler                     [WEAK]
                EXPORT  DMA14_IRQHandler                     [WEAK]
                EXPORT  DMA15_IRQHandler                     [WEAK]
                EXPORT  DMA_Error_IRQHandler                 [WEAK]
                EXPORT  MCM_IRQHandler                       [WEAK]
                EXPORT  FTFC_IRQHandler                      [WEAK]
                EXPORT  Read_Collision_IRQHandler            [WEAK]
                EXPORT  LVD_LVW_IRQHandler                   [WEAK]
                EXPORT  FTFC_Fault_IRQHandler                [WEAK]
                EXPORT  WDOG_EWM_IRQHandler                  [WEAK]
                EXPORT  RCM_IRQHandler                       [WEAK]
                EXPORT  LPI2C0_Master_IRQHandler             [WEAK]
                EXPORT  LPI2C0_Slave_IRQHandler              [WEAK]
                EXPORT  LPSPI0_IRQHandler                    [WEAK]
                EXPORT  LPSPI1_IRQHandler                    [WEAK]
                EXPORT  LPSPI2_IRQHandler                    [WEAK]
                EXPORT  Reserved45_IRQHandler                [WEAK]
                EXPORT  Reserved46_IRQHandler                [WEAK]
                EXPORT  LPUART0_RxTx_IRQHandler              [WEAK]
                EXPORT  Reserved48_IRQHandler                [WEAK]
                EXPORT  LPUART1_RxTx_IRQHandler              [WEAK]
                EXPORT  Reserved50_IRQHandler                [WEAK]
                EXPORT  LPUART2_RxTx_IRQHandler              [WEAK]
                EXPORT  Reserved52_IRQHandler                [WEAK]
                EXPORT  Reserved53_IRQHandler                [WEAK]
                EXPORT  Reserved54_IRQHandler                [WEAK]
                EXPORT  ADC0_IRQHandler                      [WEAK]
                EXPORT  ADC1_IRQHandler                      [WEAK]
                EXPORT  CMP0_IRQHandler                      [WEAK]
                EXPORT  Reserved58_IRQHandler                [WEAK]
                EXPORT  Reserved59_IRQHandler                [WEAK]
                EXPORT  ERM_single_fault_IRQHandler          [WEAK]
                EXPORT  ERM_double_fault_IRQHandler          [WEAK]
                EXPORT  RTC_IRQHandler                       [WEAK]
                EXPORT  RTC_Seconds_IRQHandler               [WEAK]
                EXPORT  LPIT0_Ch0_IRQHandler                 [WEAK]
                EXPORT  LPIT0_Ch1_IRQHandler                 [WEAK]
                EXPORT  LPIT0_Ch2_IRQHandler                 [WEAK]
                EXPORT  LPIT0_Ch3_IRQHandler                 [WEAK]
                EXPORT  PDB0_IRQHandler                      [WEAK]
                EXPORT  Reserved69_IRQHandler                [WEAK]
                EXPORT  Reserved70_IRQHandler                [WEAK]
                EXPORT  Reserved71_IRQHandler                [WEAK]
                EXPORT  Reserved72_IRQHandler                [WEAK]
                EXPORT  SCG_IRQHandler                       [WEAK]
                EXPORT  LPTMR0_IRQHandler                    [WEAK]
                EXPORT  PORTA_IRQHandler                     [WEAK]
                EXPORT  PORTB_IRQHandler                     [WEAK]
                EXPORT  PORTC_IRQHandler                     [WEAK]
                EXPORT  PORTD_IRQHandler                     [WEAK]
                EXPORT  PORTE_IRQHandler                     [WEAK]
                EXPORT  SWI_IRQHandler                       [WEAK]
                EXPORT  Reserved81_IRQHandler                [WEAK]
                EXPORT  Reserved82_IRQHandler                [WEAK]
                EXPORT  Reserved83_IRQHandler                [WEAK]
                EXPORT  PDB1_IRQHandler                      [WEAK]
                EXPORT  FLEXIO_IRQHandler                    [WEAK]
                EXPORT  Reserved86_IRQHandler                [WEAK]
                EXPORT  Reserved87_IRQHandler                [WEAK]
                EXPORT  Reserved88_IRQHandler                [WEAK]
                EXPORT  Reserved89_IRQHandler                [WEAK]
                EXPORT  Reserved90_IRQHandler                [WEAK]
                EXPORT  Reserved91_IRQHandler                [WEAK]
                EXPORT  Reserved92_IRQHandler                [WEAK]
                EXPORT  Reserved93_IRQHandler                [WEAK]
                EXPORT  CAN0_ORed_IRQHandler                 [WEAK]
                EXPORT  CAN0_Error_IRQHandler                [WEAK]
                EXPORT  CAN0_Wake_Up_IRQHandler              [WEAK]
                EXPORT  CAN0_ORed_0_15_MB_IRQHandler         [WEAK]
                EXPORT  CAN0_ORed_16_31_MB_IRQHandler        [WEAK]
                EXPORT  CAN0_ORed_32_47_MB_IRQHandler        [WEAK]
                EXPORT  CAN0_ORed_48_63_MB_IRQHandler        [WEAK]
                EXPORT  CAN1_ORed_IRQHandler                 [WEAK]
                EXPORT  CAN1_Error_IRQHandler                [WEAK]
                EXPORT  Reserved103_IRQHandler               [WEAK]
                EXPORT  CAN1_ORed_0_15_MB_IRQHandler         [WEAK]
                EXPORT  CAN1_ORed_16_31_MB_IRQHandler        [WEAK]
                EXPORT  CAN1_ORed_32_47_MB_IRQHandler        [WEAK]
                EXPORT  CAN1_ORed_48_63_MB_IRQHandler        [WEAK]
                EXPORT  Reserved108_IRQHandler               [WEAK]
                EXPORT  Reserved109_IRQHandler               [WEAK]
                EXPORT  Reserved110_IRQHandler               [WEAK]
                EXPORT  Reserved111_IRQHandler               [WEAK]
                EXPORT  Reserved112_IRQHandler               [WEAK]
                EXPORT  Reserved113_IRQHandler               [WEAK]
                EXPORT  Reserved114_IRQHandler               [WEAK]
                EXPORT  FTM0_Ch0_Ch1_IRQHandler              [WEAK]
                EXPORT  FTM0_Ch2_Ch3_IRQHandler              [WEAK]
                EXPORT  FTM0_Ch4_Ch5_IRQHandler              [WEAK]
                EXPORT  FTM0_Ch6_Ch7_IRQHandler              [WEAK]
                EXPORT  FTM0_Fault_IRQHandler                [WEAK]
                EXPORT  FTM0_Ovf_Reload_IRQHandler           [WEAK]
                EXPORT  FTM1_Ch0_Ch1_IRQHandler              [WEAK]
                EXPORT  FTM1_Ch2_Ch3_IRQHandler              [WEAK]
                EXPORT  FTM1_Ch4_Ch5_IRQHandler              [WEAK]
                EXPORT  FTM1_Ch6_Ch7_IRQHandler              [WEAK]
                EXPORT  FTM1_Fault_IRQHandler                [WEAK]
                EXPORT  FTM1_Ovf_Reload_IRQHandler           [WEAK]
                EXPORT  FTM2_Ch0_Ch1_IRQHandler              [WEAK]
                EXPORT  FTM2_Ch2_Ch3_IRQHandler              [WEAK]
                EXPORT  FTM2_Ch4_Ch5_IRQHandler              [WEAK]
                EXPORT  FTM2_Ch6_Ch7_IRQHandler              [WEAK]
                EXPORT  FTM2_Fault_IRQHandler                [WEAK]
                EXPORT  FTM2_Ovf_Reload_IRQHandler           [WEAK]
                EXPORT  FTM3_Ch0_Ch1_IRQHandler              [WEAK]
                EXPORT  FTM3_Ch2_Ch3_IRQHandler              [WEAK]
                EXPORT  FTM3_Ch4_Ch5_IRQHandler              [WEAK]
                EXPORT  FTM3_Ch6_Ch7_IRQHandler              [WEAK]
                EXPORT  FTM3_Fault_IRQHandler                [WEAK]
                EXPORT  FTM3_Ovf_Reload_IRQHandler           [WEAK]
                EXPORT  FTFC_EEERAM_ECC_ERR_IRQnHandler      [WEAK]
                EXPORT  FTFC_Mgate_ECC_ERR_IRQnHandler       [WEAK]
DMA0_IRQHandler                                  ; DMA channel 0 transfer complete
DMA1_IRQHandler                                  ; DMA channel 1 transfer complete
DMA2_IRQHandler                                  ; DMA channel 2 transfer complete
DMA3_IRQHandler                                  ; DMA channel 3 transfer complete
DMA4_IRQHandler                                  ; DMA channel 4 transfer complete
DMA5_IRQHandler                                  ; DMA channel 5 transfer complete
DMA6_IRQHandler                                  ; DMA channel 6 transfer complete
DMA7_IRQHandler                                  ; DMA channel 7 transfer complete
DMA8_IRQHandler                                  ; DMA channel 8 transfer complete
DMA9_IRQHandler                                  ; DMA channel 9 transfer complete
DMA10_IRQHandler                                 ; DMA channel 10 transfer complete
DMA11_IRQHandler                                 ; DMA channel 11 transfer complete
DMA12_IRQHandler                                 ; DMA channel 12 transfer complete
DMA13_IRQHandler                                 ; DMA channel 13 transfer complete
DMA14_IRQHandler                                 ; DMA channel 14 transfer complete
DMA15_IRQHandler                                 ; DMA channel 15 transfer complete
DMA_Error_IRQHandler                             ; DMA error interrupt channels 0-15
MCM_IRQHandler                                   ; FPU sources
FTFC_IRQHandler                                  ; FTFC Command complete
Read_Collision_IRQHandler                        ; FTFC Read collision
LVD_LVW_IRQHandler                               ; PMC Low voltage detect interrupt
FTFC_Fault_IRQHandler                            ; FTFC Double bit fault detect
WDOG_EWM_IRQHandler                              ; Single interrupt vector for WDOG and EWM
RCM_IRQHandler                                   ; RCM Asynchronous Interrupt
LPI2C0_Master_IRQHandler                         ; LPI2C0 Master Interrupt
LPI2C0_Slave_IRQHandler                          ; LPI2C0 Slave Interrupt
LPSPI0_IRQHandler                                ; LPSPI0 Interrupt
LPSPI1_IRQHandler                                ; LPSPI1 Interrupt
LPSPI2_IRQHandler                                ; LPSPI2 Interrupt
Reserved45_IRQHandler                            ; Reserved Interrupt 45
Reserved46_IRQHandler                            ; Reserved Interrupt 46
LPUART0_RxTx_IRQHandler                          ; LPUART0 Transmit / Receive Interrupt
Reserved48_IRQHandler                            ; Reserved Interrupt 48
LPUART1_RxTx_IRQHandler                          ; LPUART1 Transmit / Receive  Interrupt
Reserved50_IRQHandler                            ; Reserved Interrupt 50
LPUART2_RxTx_IRQHandler                          ; LPUART2 Transmit / Receive  Interrupt
Reserved52_IRQHandler                            ; Reserved Interrupt 52
Reserved53_IRQHandler                            ; Reserved Interrupt 53
Reserved54_IRQHandler                            ; Reserved Interrupt 54
ADC0_IRQHandler                                  ; ADC0 interrupt request.
ADC1_IRQHandler                                  ; ADC1 interrupt request.
CMP0_IRQHandler                                  ; CMP0 interrupt request
Reserved58_IRQHandler                            ; Reserved Interrupt 58
Reserved59_IRQHandler                            ; Reserved Interrupt 59
ERM_single_fault_IRQHandler                      ; ERM single bit error correction
ERM_double_fault_IRQHandler                      ; ERM double bit error non-correctable
RTC_IRQHandler                                   ; RTC alarm interrupt
RTC_Seconds_IRQHandler                           ; RTC seconds interrupt
LPIT0_Ch0_IRQHandler                             ; LPIT0 channel 0 overflow interrupt
LPIT0_Ch1_IRQHandler                             ; LPIT0 channel 1 overflow interrupt
LPIT0_Ch2_IRQHandler                             ; LPIT0 channel 2 overflow interrupt
LPIT0_Ch3_IRQHandler                             ; LPIT0 channel 3 overflow interrupt
PDB0_IRQHandler                                  ; PDB0 interrupt
Reserved69_IRQHandler                            ; Reserved Interrupt 69
Reserved70_IRQHandler                            ; Reserved Interrupt 70
Reserved71_IRQHandler                            ; Reserved Interrupt 71
Reserved72_IRQHandler                            ; Reserved Interrupt 72
SCG_IRQHandler                                   ; SCG bus interrupt request
LPTMR0_IRQHandler                                ; LPTIMER interrupt request
PORTA_IRQHandler                                 ; Port A pin detect interrupt
PORTB_IRQHandler                                 ; Port B pin detect interrupt
PORTC_IRQHandler                                 ; Port C pin detect interrupt
PORTD_IRQHandler                                 ; Port D pin detect interrupt
PORTE_IRQHandler                                 ; Port E pin detect interrupt
SWI_IRQHandler                                   ; Software interrupt
Reserved81_IRQHandler                            ; Reserved Interrupt 81
Reserved82_IRQHandler                            ; Reserved Interrupt 82
Reserved83_IRQHandler                            ; Reserved Interrupt 83
PDB1_IRQHandler                                  ; PDB1 interrupt
FLEXIO_IRQHandler                                ; FlexIO Interrupt
Reserved86_IRQHandler                            ; Reserved Interrupt 86
Reserved87_IRQHandler                            ; Reserved Interrupt 87
Reserved88_IRQHandler                            ; Reserved Interrupt 88
Reserved89_IRQHandler                            ; Reserved Interrupt 89
Reserved90_IRQHandler                            ; Reserved Interrupt 90
Reserved91_IRQHandler                            ; Reserved Interrupt 91
Reserved92_IRQHandler                            ; Reserved Interrupt 92
Reserved93_IRQHandler                            ; Reserved Interrupt 93
CAN0_ORed_IRQHandler                             ; CAN0 OR'ed [Bus Off OR Transmit Warning OR Receive Warning]
CAN0_Error_IRQHandler                            ; CAN0 Interrupt indicating that errors were detected on the CAN bus
CAN0_Wake_Up_IRQHandler                          ; CAN0 Interrupt asserted when Pretended Networking operation is enabled, and a valid message matches the selected filter criteria during Low Power mode
CAN0_ORed_0_15_MB_IRQHandler                     ; CAN0 OR'ed Message buffer (0-15)
CAN0_ORed_16_31_MB_IRQHandler                    ; CAN0 OR'ed Message buffer (16-31)
CAN0_ORed_32_47_MB_IRQHandler                    ; CAN0 OR'ed Message buffer (32-47)
CAN0_ORed_48_63_MB_IRQHandler                    ; CAN0 OR'ed Message buffer (48-63)
CAN1_ORed_IRQHandler                             ; CAN1 OR'ed [Bus Off OR Transmit Warning OR Receive Warning]
CAN1_Error_IRQHandler                            ; CAN1 Interrupt indicating that errors were detected on the CAN bus
Reserved103_IRQHandler                           ; Reserved Interrupt 103
CAN1_ORed_0_15_MB_IRQHandler                     ; CAN1 OR'ed Interrupt for Message buffer (0-15)
CAN1_ORed_16_31_MB_IRQHandler                    ; CAN1 OR'ed Message buffer (16-31)
CAN1_ORed_32_47_MB_IRQHandler                    ; CAN1 OR'ed Message buffer (32-47)
CAN1_ORed_48_63_MB_IRQHandler                    ; CAN1 OR'ed Message buffer (48-63)
Reserved108_IRQHandler                           ; Reserved Interrupt 108
Reserved109_IRQHandler                           ; Reserved Interrupt 109
Reserved110_IRQHandler                           ; Reserved Interrupt 110
Reserved111_IRQHandler                           ; Reserved Interrupt 111
Reserved112_IRQHandler                           ; Reserved Interrupt 112
Reserved113_IRQHandler                           ; Reserved Interrupt 113
Reserved114_IRQHandler                           ; Reserved Interrupt 114
FTM0_Ch0_Ch1_IRQHandler                          ; FTM0 Channel 0 and 1 interrupt
FTM0_Ch2_Ch3_IRQHandler                          ; FTM0 Channel 2 and 3 interrupt
FTM0_Ch4_Ch5_IRQHandler                          ; FTM0 Channel 4 and 5 interrupt
FTM0_Ch6_Ch7_IRQHandler                          ; FTM0 Channel 6 and 7 interrupt
FTM0_Fault_IRQHandler                            ; FTM0 Fault interrupt
FTM0_Ovf_Reload_IRQHandler                       ; FTM0 Counter overflow and Reload interrupt
FTM1_Ch0_Ch1_IRQHandler                          ; FTM1 Channel 0 and 1 interrupt
FTM1_Ch2_Ch3_IRQHandler                          ; FTM1 Channel 2 and 3 interrupt
FTM1_Ch4_Ch5_IRQHandler                          ; FTM1 Channel 4 and 5 interrupt
FTM1_Ch6_Ch7_IRQHandler                          ; FTM1 Channel 6 and 7 interrupt
FTM1_Fault_IRQHandler                            ; FTM1 Fault interrupt
FTM1_Ovf_Reload_IRQHandler                       ; FTM1 Counter overflow and Reload interrupt
FTM2_Ch0_Ch1_IRQHandler                          ; FTM2 Channel 0 and 1 interrupt
FTM2_Ch2_Ch3_IRQHandler                          ; FTM2 Channel 2 and 3 interrupt
FTM2_Ch4_Ch5_IRQHandler                          ; FTM2 Channel 4 and 5 interrupt
FTM2_Ch6_Ch7_IRQHandler                          ; FTM2 Channel 6 and 7 interrupt
FTM2_Fault_IRQHandler                            ; FTM2 Fault interrupt
FTM2_Ovf_Reload_IRQHandler                       ; FTM2 Counter overflow and Reload interrupt
FTM3_Ch0_Ch1_IRQHandler                          ; FTM3 Channel 0 and 1 interrupt
FTM3_Ch2_Ch3_IRQHandler                          ; FTM3 Channel 2 and 3 interrupt
FTM3_Ch4_Ch5_IRQHandler                          ; FTM3 Channel 4 and 5 interrupt
FTM3_Ch6_Ch7_IRQHandler                          ; FTM3 Channel 6 and 7 interrupt
FTM3_Fault_IRQHandler                            ; FTM3 Fault interrupt
FTM3_Ovf_Reload_IRQHandler                       ; FTM3 Counter overflow and Reload interrupt
FTFC_EEERAM_ECC_ERR_IRQnHandler                  ; FFTC EEERAM ECC error
FTFC_Mgate_ECC_ERR_IRQnHandler                   ; FFTC Mgate ECC error

                B       .

                ENDP

                ALIGN
                END